Vorlesung/ProPar-FuProAlgDat.org
# +SETUPFILE: /Users/johannes/Documents/myOrg/org-html-themes/setup/theme-bigblow.setup
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Funktionale Programmierung -- Algebraische Datentypen
#+SUBTITLE: Programmierparadigmen
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:nil
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
# +REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t

# um Folien mit reveal.js erzeugen zu können:ml
# M-x load-library und dann ox-reveal

* Datenstrukturen 

** Datenstrukturen als Datenabstraktion

-  Grundgedanke: Einzelne Dinge werden zu einem neuen Ganzen.

   -  Aus 5000 Einzelteilen entsteht ein Auto.

   -  Aus zwei Keksen und Schokocreme entsteht ein Waffelkeks.

   -  Aus zwei Koordinaten entsteht ein Punkt.

   -  Aus einer Menge von Merkmalen entsteht eine Objektstruktur.

-  ein Beispiel:

#+BEGIN_EXAMPLE
    ; Ein Punkt besteht aus
    ; - einer Zahl für die X-,
    ; - einer Zahl für die Y-Koordinate
    ; ->punkt : number number -> punkt
    ; :x :     punkt -> number
    ; :y :    punkt -> number
#+END_EXAMPLE

** Record-Definition in Clojure
#+BEGIN_SRC clojure 
    ; Ein Punkt besteht aus
    ; - einer Zahl für die X-,
    ; - einer Zahl für die Y-Koordinate
    ; ->punkt : number number -> punkt
    ; :x :      punkt -> number
    ; :y :      punkt -> number
    (defrecord punkt 
      [x y])
#+END_SRC

** Record-Benutzung in Clojure

#+BEGIN_SRC clojure 
user> (defrecord punkt [x y])
;; => user.punkt
user> (->punkt 2 3)
;; => #user.punkt{:x 2, :y 3}
user> (:x (->punkt 2 3))
;; => 2
user> (:y (->punkt 2 3))
;; => 3
user> (instance? punkt (->punkt 2 3))
;; => true
user> 
#+END_SRC

** Strukturverarbeitende Funktionen 
Beispiel: Berechnung der Entfernung eines Punktes vom Ursprung

#+BEGIN_SRC clojure
(use 'clojure.test)
;; Abstand eines Punktes vom Ursprung berechnen
;; abstand-vom-ursprung: punkt -> number
(def abstand-vom-ursprung
  (fn [p]
    {:pre  [(instance? punkt p)]
     :post [(number? %)]}
    (Math/sqrt
     (+ (* (:x p) (:x p))
        (* (:y p) (:y p))))))
;; Tests
(deftest test-absabstand-vom-ursprung
  (is (= (* 0.01 (Math/round (* 100 (abstand-vom-ursprung (->punkt 2 2)))))
         2.83)))
(run-tests)
#+END_SRC

* Entwurfsvorschrift III -- Strukturverarbeitende Funktionen
Die vier
Phasen der Entwurfsvorschrift I werden wieder um eine Phase
/Datenanalyse/ ergänzt, der Phase /Funktionsrumpf/ wird eine Phase
/Funktionsschablone/ vorgeschaltet:

1. Vertrag, Funktionskopf, Zweckbestimmung

2. *Datenanalyse/Datendefinition*

3. Beispiele / Tests

4. *Funktionsschablone*

5. Funktionsrumpf

6. Testen

Es folgt die Beschreibung der neuen bzw. angepassten Phasen.

** Entwurfsvorschrift III - Phase 2

Datenanalyse/Datendefinition

-  Ziel: Entwicklung einer adäquaten Datenstruktur

-  Aktivitäten:

   -  beschreibe die Datenstruktur in der Form:

      ; Ein $s$ besteht aus\\
      ; - einem /t/ für die /s_1/-Komponente,\\
      ; - \(\ldots\)\\
      ; ->s  : ($t \dots$ -> $s$) \\
      ; :s_1 : ($s$ -> $t$))\\
      ...

   -  definiere die Datenstruktur:\\
      (defrecord $s$ [$s_1$ ...])

