Vorlesung/ProPar-FuProAlgDat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-10-10 Tue 21:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Funktionale Programmierung &#x2013; Algebraische Datentypen</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Funktionale Programmierung &#x2013; Algebraische Datentypen
<br />
<span class="subtitle">Programmierparadigmen</span>
</h1>

<div id="outline-container-org77a5a1f" class="outline-2">
<h2 id="org77a5a1f">Datenstrukturen</h2>
<div class="outline-text-2" id="text-org77a5a1f">
</div><div id="outline-container-org92b059f" class="outline-3">
<h3 id="org92b059f">Datenstrukturen als Datenabstraktion</h3>
<div class="outline-text-3" id="text-org92b059f">
<ul class="org-ul">
<li>Grundgedanke: Einzelne Dinge werden zu einem neuen Ganzen.

<ul class="org-ul">
<li>Aus 5000 Einzelteilen entsteht ein Auto.</li>

<li>Aus zwei Keksen und Schokocreme entsteht ein Waffelkeks.</li>

<li>Aus zwei Koordinaten entsteht ein Punkt.</li>

<li>Aus einer Menge von Merkmalen entsteht eine Objektstruktur.</li>
</ul></li>

<li>ein Beispiel:</li>
</ul>

<pre class="example">
    ; Ein Punkt besteht aus
    ; - einer Zahl für die X-,
    ; - einer Zahl für die Y-Koordinate
    ; -&gt;punkt : number number -&gt; punkt
    ; :x :     punkt -&gt; number
    ; :y :    punkt -&gt; number
</pre>
</div>
</div>

<div id="outline-container-org71a9520" class="outline-3">
<h3 id="org71a9520">Record-Definition in Clojure</h3>
<div class="outline-text-3" id="text-org71a9520">
<div class="org-src-container">
<pre class="src src-clojure">    <span style="color: #8D8D84; font-style: italic;">; Ein Punkt besteht aus</span>
    <span style="color: #8D8D84; font-style: italic;">; - einer Zahl f&#252;r die X-,</span>
    <span style="color: #8D8D84; font-style: italic;">; - einer Zahl f&#252;r die Y-Koordinate</span>
    <span style="color: #8D8D84; font-style: italic;">; -&gt;punkt : number number -&gt; punkt</span>
    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">:x</span><span style="color: #8D8D84; font-style: italic;"> :      punkt -&gt; number</span>
    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">:y</span><span style="color: #8D8D84; font-style: italic;"> :      punkt -&gt; number</span>
    <span style="color: #707183;">(</span><span style="color: #0000FF;">defrecord</span> <span style="color: #6434A3;">punkt</span> 
      <span style="color: #7388D6;">[</span>x y<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f64eba" class="outline-3">
<h3 id="org7f64eba">Record-Benutzung in Clojure</h3>
<div class="outline-text-3" id="text-org7f64eba">
<div class="org-src-container">
<pre class="src src-clojure">user&gt; <span style="color: #707183;">(</span><span style="color: #0000FF;">defrecord</span> <span style="color: #6434A3;">punkt</span> <span style="color: #7388D6;">[</span>x y<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">=&gt; user.punkt</span>
user&gt; <span style="color: #707183;">(</span>-&gt;punkt 2 3<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">=&gt; #user.punkt{</span><span style="color: #8D8D84; font-style: italic;">:x</span><span style="color: #8D8D84; font-style: italic;"> 2, </span><span style="color: #8D8D84; font-style: italic;">:y</span><span style="color: #8D8D84; font-style: italic;"> 3}</span>
user&gt; <span style="color: #707183;">(</span><span style="color: #D0372D;">:x</span> <span style="color: #7388D6;">(</span>-&gt;punkt 2 3<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">=&gt; 2</span>
user&gt; <span style="color: #707183;">(</span><span style="color: #D0372D;">:y</span> <span style="color: #7388D6;">(</span>-&gt;punkt 2 3<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">=&gt; 3</span>
user&gt; <span style="color: #707183;">(</span><span style="color: #006FE0;">instance?</span> punkt <span style="color: #7388D6;">(</span>-&gt;punkt 2 3<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">=&gt; true</span>
user&gt; </pre>
</pre>
</div>
</div>
</div>

<div id="outline-container-org883f0ae" class="outline-3">
<h3 id="org883f0ae">Strukturverarbeitende Funktionen</h3>
<div class="outline-text-3" id="text-org883f0ae">
<p>
Beispiel: Berechnung der Entfernung eines Punktes vom Ursprung
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> '<span style="color: #6434A3;">clojure.test</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Abstand eines Punktes vom Ursprung berechnen</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">abstand-vom-ursprung: punkt -&gt; number</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">abstand-vom-ursprung</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>p<span style="color: #909183;">]</span>
    <span style="color: #909183;">{</span><span style="color: #D0372D;">:pre</span>  <span style="color: #709870;">[</span><span style="color: #907373;">(</span><span style="color: #006FE0;">instance?</span> punkt p<span style="color: #907373;">)</span><span style="color: #709870;">]</span>
     <span style="color: #D0372D;">:post</span> <span style="color: #709870;">[</span><span style="color: #907373;">(</span><span style="color: #006FE0;">number?</span> <span style="color: #BA36A5;">%</span><span style="color: #907373;">)</span><span style="color: #709870;">]</span><span style="color: #909183;">}</span>
    <span style="color: #909183;">(</span><span style="color: #6434A3;">Math</span><span style="font-family: DejaVu Sans Mono,monospace,sans-serif; color: #000000; background-color: #ffffff;">/</span>sqrt
     <span style="color: #709870;">(</span>+ <span style="color: #907373;">(</span>* <span style="color: #6276BA;">(</span><span style="color: #D0372D;">:x</span> p<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span><span style="color: #D0372D;">:x</span> p<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>* <span style="color: #6276BA;">(</span><span style="color: #D0372D;">:y</span> p<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">(</span><span style="color: #D0372D;">:y</span> p<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Tests</span>
<span style="color: #707183;">(</span><span style="color: #006FE0;">deftest</span> <span style="color: #006699;">test-absabstand-vom-ursprung</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">is</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>* 0.01 <span style="color: #907373;">(</span><span style="color: #6434A3;">Math</span><span style="font-family: DejaVu Sans Mono,monospace,sans-serif; color: #000000; background-color: #ffffff;">/</span>round <span style="color: #6276BA;">(</span>* 100 <span style="color: #858580;">(</span>abstand-vom-ursprung <span style="color: #80A880;">(</span>-&gt;punkt 2 2<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         2.83<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #006FE0;">run-tests</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org466a3c9" class="outline-2">
<h2 id="org466a3c9">Entwurfsvorschrift III &#x2013; Strukturverarbeitende Funktionen</h2>
<div class="outline-text-2" id="text-org466a3c9">
<p>
Die vier
Phasen der Entwurfsvorschrift I werden wieder um eine Phase
<i>Datenanalyse</i> ergänzt, der Phase <i>Funktionsrumpf</i> wird eine Phase
<i>Funktionsschablone</i> vorgeschaltet:
</p>

<ol class="org-ol">
<li>Vertrag, Funktionskopf, Zweckbestimmung</li>

<li><b>Datenanalyse/Datendefinition</b></li>

<li>Beispiele / Tests</li>

<li><b>Funktionsschablone</b></li>

<li>Funktionsrumpf</li>

<li>Testen</li>
</ol>

<p>
Es folgt die Beschreibung der neuen bzw. angepassten Phasen.
</p>
</div>

<div id="outline-container-orgadb239d" class="outline-3">
<h3 id="orgadb239d">Entwurfsvorschrift III - Phase 2</h3>
<div class="outline-text-3" id="text-orgadb239d">
<p>
Datenanalyse/Datendefinition
</p>

<ul class="org-ul">
<li>Ziel: Entwicklung einer adäquaten Datenstruktur</li>

<li>Aktivitäten:

<ul class="org-ul">
<li><p>
beschreibe die Datenstruktur in der Form:
</p>

<p>
; Ein \(s\) besteht aus<br />
; - einem <i>t</i> für die <i>s<sub>1</sub></i>-Komponente,<br />
; - \(\ldots\)<br />
; -&gt;s  : (\(t \dots\) -&gt; \(s\)) <br />
; :s<sub>1</sub> : (\(s\) -&gt; \(t\)))<br />
&#x2026;
</p></li>

<li>definiere die Datenstruktur:<br />
(defrecord \(s\) [\(s_1\) &#x2026;])</li>
</ul></li>
</ul>
</div>
</div>
