Vorlesung/ProPar-FuProAlgDat.org
** Entwurfsvorschrift III - Phase 4

Funktionsschablone

-  Ziel: Bestimmung der für die Berechnung des Ergebnisses
   erforderlichen Selektoren („Getter”) bzw. Konstruktoren.

-  Aktivitäten:

   -  Für jede Komponente der Datenstruktur, von deren Wert das Ergebnis
      der Funktion abhängt, schreibe den zugehörigen Selektor in die
      Funktionsschablone.

   -  Falls die Funktion eine Datenstruktur als Resultat liefern muss,
      nimm den Aufruf des Konstruktors in die Schablone mit auf.

#+BEGIN_SRC clojure
    (def verarbeite-punkt-zu-neuem-punkt
      (fn [p]
        (-> ...
          (... (:x p) ...
           ... (:y p) ...))))
#+END_SRC

* Gemischte Daten

** Datenabstraktion durch Generalisierung

-  Funktionen sollen verschiedene -- aber verwandte -- Datenstrukturen
   verarbeiten.

-  Beispiel: Rechtecke und Kreise sind geometrische Figuren.

   #+begin_small
   #+BEGIN_SRC clojure
       ; Eine figur ist entweder
       ; - ein Rechteck  
       ;     (->rechteck b h)
       ; oder
       ; - ein Kreis
       ;     (->kreis r)
   #+END_SRC
   #+end_small
-  Ein Wert, der zum Vertrag =figur= passt, muss entweder den Vertrag
   von =rechteck= oder von =kreis= erfüllen.

-  =figur= setzt natürlich die Definition von =rechteck= und =kreis=
   voraus.

** Definition von =rechteck=

#+BEGIN_SRC clojure
(use 'clojure.test)

;; Eine Rechteck besteht aus
;; - einer Zahl für die Höhe,
;; - einer Zahl für die Breite
;; ->rechteck:  number number -> rechteck
;; :breite :    (rechteck -> number))
;; :hoehe :     (rechteck -> number)

(defrecord rechteck
    [breite hoehe])

;; Rechteckfläche berechnen
(def rechteck-flaeche
  (fn [r]
    {:pre  [instance? rechteck r]
     :post [number? %]}
    (* (:breite r) (:hoehe r))))

(deftest test-rechteck 
  (is (= (rechteck-flaeche (->rechteck 3 4)) 12)))

(run-tests)
#+END_SRC


** Definition von =kreis=

#+BEGIN_SRC clojure 
(use 'clojure.test)

;; Ein Kreis besteht aus
;; - einer Zahl für den Radius,
;; ->kreis:  number -> kreis
;; :radius : kreis -> number

(defrecord kreis
    [radius])

;; Rechteckfläche berechnen
(def kreis-flaeche
  (fn [k]
    {:pre  [instance? kreis k]
     :post [number? %]}
    (* (:radius k) (:radius k) 3.14159)))

(deftest test-kreis 
  (is (= (* 0.01 (Math/round (* 100  (kreis-flaeche (->kreis 1.0))))) 3.14)))
(run-tests)
#+END_SRC

