Vorlesung/ProPar-FuProAlgDat.html

<div id="outline-container-orgc8c343e" class="outline-3">
<h3 id="orgc8c343e">Entwurfsvorschrift III - Phase 4</h3>
<div class="outline-text-3" id="text-orgc8c343e">
<p>
Funktionsschablone
</p>

<ul class="org-ul">
<li>Ziel: Bestimmung der für die Berechnung des Ergebnisses
erforderlichen Selektoren („Getter”) bzw. Konstruktoren.</li>

<li>Aktivitäten:

<ul class="org-ul">
<li>Für jede Komponente der Datenstruktur, von deren Wert das Ergebnis
der Funktion abhängt, schreibe den zugehörigen Selektor in die
Funktionsschablone.</li>

<li>Falls die Funktion eine Datenstruktur als Resultat liefern muss,
nimm den Aufruf des Konstruktors in die Schablone mit auf.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-clojure">    <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">verarbeite-punkt-zu-neuem-punkt</span>
      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>p<span style="color: #909183;">]</span>
        <span style="color: #909183;">(</span><span style="color: #0000FF;">-&gt;</span> ...
          <span style="color: #709870;">(</span>... <span style="color: #907373;">(</span><span style="color: #D0372D;">:x</span> p<span style="color: #907373;">)</span> ...
           ... <span style="color: #907373;">(</span><span style="color: #D0372D;">:y</span> p<span style="color: #907373;">)</span> ...<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd25b875" class="outline-2">
<h2 id="orgd25b875">Gemischte Daten</h2>
<div class="outline-text-2" id="text-orgd25b875">
</div><div id="outline-container-org76dd715" class="outline-3">
<h3 id="org76dd715">Datenabstraktion durch Generalisierung</h3>
<div class="outline-text-3" id="text-org76dd715">
<ul class="org-ul">
<li>Funktionen sollen verschiedene &#x2013; aber verwandte &#x2013; Datenstrukturen
verarbeiten.</li>

<li><p>
Beispiel: Rechtecke und Kreise sind geometrische Figuren.
</p>

<div class="small">
<div class="org-src-container">
<pre class="src src-clojure">       <span style="color: #8D8D84; font-style: italic;">; Eine figur ist entweder</span>
       <span style="color: #8D8D84; font-style: italic;">; - ein Rechteck  </span>
       <span style="color: #8D8D84; font-style: italic;">;     (-&gt;rechteck b h)</span>
       <span style="color: #8D8D84; font-style: italic;">; oder</span>
       <span style="color: #8D8D84; font-style: italic;">; - ein Kreis</span>
       <span style="color: #8D8D84; font-style: italic;">;     (-&gt;kreis r)</span></pre>
</pre>
</div>

</div></li>
<li>Ein Wert, der zum Vertrag <code>figur</code> passt, muss entweder den Vertrag
von <code>rechteck</code> oder von <code>kreis</code> erfüllen.</li>

<li><code>figur</code> setzt natürlich die Definition von <code>rechteck</code> und <code>kreis</code>
voraus.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc55ddc" class="outline-3">
<h3 id="orgbc55ddc">Definition von <code>rechteck</code></h3>
<div class="outline-text-3" id="text-orgbc55ddc">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> '<span style="color: #6434A3;">clojure.test</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Eine Rechteck besteht aus</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">- einer Zahl f&#252;r die H&#246;he,</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">- einer Zahl f&#252;r die Breite</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">-&gt;rechteck:  number number -&gt; rechteck</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">:breite</span><span style="color: #8D8D84; font-style: italic;"> :    (rechteck -&gt; number))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">:hoehe</span><span style="color: #8D8D84; font-style: italic;"> :     (rechteck -&gt; number)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defrecord</span> <span style="color: #6434A3;">rechteck</span>
    <span style="color: #7388D6;">[</span>breite hoehe<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Rechteckfl&#228;che berechnen</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">rechteck-flaeche</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>r<span style="color: #909183;">]</span>
    <span style="color: #909183;">{</span><span style="color: #D0372D;">:pre</span>  <span style="color: #709870;">[</span>instance? rechteck r<span style="color: #709870;">]</span>
     <span style="color: #D0372D;">:post</span> <span style="color: #709870;">[</span>number? <span style="color: #BA36A5;">%</span><span style="color: #709870;">]</span><span style="color: #909183;">}</span>
    <span style="color: #909183;">(</span>* <span style="color: #709870;">(</span><span style="color: #D0372D;">:breite</span> r<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #D0372D;">:hoehe</span> r<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #006FE0;">deftest</span> <span style="color: #006699;">test-rechteck</span> 
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">is</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>rechteck-flaeche <span style="color: #907373;">(</span>-&gt;rechteck 3 4<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 12<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #006FE0;">run-tests</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>


<div id="outline-container-org46df88b" class="outline-3">
<h3 id="org46df88b">Definition von <code>kreis</code></h3>
<div class="outline-text-3" id="text-org46df88b">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> '<span style="color: #6434A3;">clojure.test</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Ein Kreis besteht aus</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">- einer Zahl f&#252;r den Radius,</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">-&gt;kreis:  number -&gt; kreis</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">:radius</span><span style="color: #8D8D84; font-style: italic;"> : kreis -&gt; number</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">defrecord</span> <span style="color: #6434A3;">kreis</span>
    <span style="color: #7388D6;">[</span>radius<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Rechteckfl&#228;che berechnen</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">kreis-flaeche</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>k<span style="color: #909183;">]</span>
    <span style="color: #909183;">{</span><span style="color: #D0372D;">:pre</span>  <span style="color: #709870;">[</span>instance? kreis k<span style="color: #709870;">]</span>
     <span style="color: #D0372D;">:post</span> <span style="color: #709870;">[</span>number? <span style="color: #BA36A5;">%</span><span style="color: #709870;">]</span><span style="color: #909183;">}</span>
    <span style="color: #909183;">(</span>* <span style="color: #709870;">(</span><span style="color: #D0372D;">:radius</span> k<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #D0372D;">:radius</span> k<span style="color: #709870;">)</span> 3.14159<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #006FE0;">deftest</span> <span style="color: #006699;">test-kreis</span> 
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">is</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>* 0.01 <span style="color: #907373;">(</span><span style="color: #6434A3;">Math</span><span style="font-family: DejaVu Sans Mono,monospace,sans-serif; color: #000000; background-color: #ffffff;">/</span>round <span style="color: #6276BA;">(</span>* 100  <span style="color: #858580;">(</span>kreis-flaeche <span style="color: #80A880;">(</span>-&gt;kreis 1.0<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> 3.14<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #006FE0;">run-tests</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>
