Vorlesung/ProPar-FuProAlgDat.org
** Flächeninhalt von Figuren

#+BEGIN_SRC clojure
(use 'clojure.test)

;; Eine figur ist entweder
;; - ein Rechteck  
;;     (->rechteck b h)
;; oder
;; - ein Kreis
;;     (->kreis r)
(def figur-flaeche
  (fn [f]
    {:pre [or (instance? rechteck f)
              (instance? kreis f)]
     :post [number? %]}
    (cond
      (instance? kreis f)
      (kreis-flaeche f)
      (instance? rechteck f)
      (rechteck-flaeche f))))

(deftest test-figuren 
  (is (= (* 0.01 (Math/round (* 100  (figur-flaeche (->kreis 1.0))))) 3.14))
  (is (= (figur-flaeche (->rechteck 3 4)) 12)))
(run-tests)
#+END_SRC

* Entwurfsvorschrift IV -- Verarbeitung gemischter Daten
Diese
Entwurfsvorschrift stellt die „Verschmelzung” der Entwurfsvorschriften
II und III dar. Wenn sich in der Phase /Datenanalyse/ herausstellt, dass
gemischte Daten zu verarbeiten sind, ergibt sich für eine gemischte
Daten verarbeitende Funktion eine Fallunterscheidung nach dem Typ der
Daten. Damit handelt es sich um eine bedingte Funktion.

Die Phasen von Entwurfsvorschrift III bleiben erhalten.:

#+REVEAL: split
1. Vertrag, Funktionskopf, Zweckbestimmung

2. *Datenanalyse/Datendefinition*

3. Beispiele / Tests

4. *Funktionsschablone*

5. Funktionsrumpf

6. Testen

Es folgt die Beschreibung der neuen bzw. angepassten Phasen.

** Entwurfsvorschrift IV - Phase 2

*Datenanalyse/Datendefinition*

-  Ziel: Entwicklung einer adäquaten Datenstruktur

-  Aktivität: Beschreibe die Datenstruktur in der Form:

   ; Ein $s$ ist entweder\\
   ; - ein $t_1$ oder\\
   ; - $\ldots$ oder\\
   ; - ein $t_n$

-  Für den Vertrag:
   #+BEGIN_SRC clojure  
   {:pre [(or (instance? t-1 s)
              ...
              (instance? t-n s))]}
   #+END_SRC

** Entwurfsvorschrift IV - Phase 4

*Funktionsschablone*

-  Ziel: Konstruktion der Fallunterscheidung nach der Art der Daten

-  Aktivitäten:

   -  Lege die folgende Funktionsschablone an:

#+BEGIN_SRC clojure
    (def f
      (fn [x]
        {:pre [(or (instance? t-1 x)
                   (instance? t-2 x)
                    ...
                   (instance? t-n x))]
         :post [...]}
        (cond
           (instance? t-1 x) ...
           (instance? t-2 x) ...
           ...
           (instance? t-n x) ...)))
#+END_SRC

* Exkurs: Algebraische Datentypen
** Produkttypen
+ Die in Kapitel [[Datenstrukturen][Datenstrukturen]] erläuterten Strukturdefinitionen
  nennt man of auch /Produkte/.
+ Die Menge aller Exemplare der Record-Definition =punkt=
  (vgl. [[Record-Definition in Clojure]]) kann man als als Teilmenge des
  kartesischen Produkts 
  $$number \times number$$
  angesehen werden.
+ Daher die Bezeichnung /Produkttypen/.
** Summentypen
+ Die in Kapitel [[Gemischte Daten]] eingeführten varianten Typen
  #+BEGIN_QUOTE
     Eine Figur ist entweder ein Rechteck oder ein Kreis.
     #+END_QUOTE
  werden auch als Summentypen bezeichnet.
+ Die Menge aller Figuren ist die Vereinigung der Menge aller Kreise
  mit der Menge aller Rechtecke.
+ Die /Vereinigung von Mengen/ wird auch als die /Summe der Mengen/
  bezeichnet.
+ Daher die Bezeichnung Summentypen.

*** Haskell
Der Begriff der algebraischen Datentypen ist inbesondere im Kontext
der Programmiersprache [[https://www.haskell.org][Haskell]] sehr gebräuchlich.
* Exkurs: Funktionale vs. objektorientierte Programmierung

