Vorlesung/ProPar-FuProAlgDat.html

<div id="outline-container-org065bfbf" class="outline-3">
<h3 id="org065bfbf">Flächeninhalt von Figuren</h3>
<div class="outline-text-3" id="text-org065bfbf">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> '<span style="color: #6434A3;">clojure.test</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Eine figur ist entweder</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">- ein Rechteck  </span>
<span style="color: #8D8D84;">;;     </span><span style="color: #8D8D84; font-style: italic;">(-&gt;rechteck b h)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">oder</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">- ein Kreis</span>
<span style="color: #8D8D84;">;;     </span><span style="color: #8D8D84; font-style: italic;">(-&gt;kreis r)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">figur-flaeche</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>f<span style="color: #909183;">]</span>
    <span style="color: #909183;">{</span><span style="color: #D0372D;">:pre</span> <span style="color: #709870;">[</span>or <span style="color: #907373;">(</span><span style="color: #006FE0;">instance?</span> rechteck f<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #006FE0;">instance?</span> kreis f<span style="color: #907373;">)</span><span style="color: #709870;">]</span>
     <span style="color: #D0372D;">:post</span> <span style="color: #709870;">[</span>number? <span style="color: #BA36A5;">%</span><span style="color: #709870;">]</span><span style="color: #909183;">}</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> kreis f<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>kreis-flaeche f<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> rechteck f<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>rechteck-flaeche f<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #006FE0;">deftest</span> <span style="color: #006699;">test-figuren</span> 
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">is</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>* 0.01 <span style="color: #907373;">(</span><span style="color: #6434A3;">Math</span><span style="font-family: DejaVu Sans Mono,monospace,sans-serif; color: #000000; background-color: #ffffff;">/</span>round <span style="color: #6276BA;">(</span>* 100  <span style="color: #858580;">(</span>figur-flaeche <span style="color: #80A880;">(</span>-&gt;kreis 1.0<span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> 3.14<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #006FE0;">is</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>figur-flaeche <span style="color: #907373;">(</span>-&gt;rechteck 3 4<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 12<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #006FE0;">run-tests</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4885832" class="outline-2">
<h2 id="org4885832">Entwurfsvorschrift IV &#x2013; Verarbeitung gemischter Daten</h2>
<div class="outline-text-2" id="text-org4885832">
<p>
Diese
Entwurfsvorschrift stellt die „Verschmelzung” der Entwurfsvorschriften
II und III dar. Wenn sich in der Phase <i>Datenanalyse</i> herausstellt, dass
gemischte Daten zu verarbeiten sind, ergibt sich für eine gemischte
Daten verarbeitende Funktion eine Fallunterscheidung nach dem Typ der
Daten. Damit handelt es sich um eine bedingte Funktion.
</p>

<p>
Die Phasen von Entwurfsvorschrift III bleiben erhalten.:
</p>

<ol class="org-ol">
<li>Vertrag, Funktionskopf, Zweckbestimmung</li>

<li><b>Datenanalyse/Datendefinition</b></li>

<li>Beispiele / Tests</li>

<li><b>Funktionsschablone</b></li>

<li>Funktionsrumpf</li>

<li>Testen</li>
</ol>

<p>
Es folgt die Beschreibung der neuen bzw. angepassten Phasen.
</p>
</div>

<div id="outline-container-org27f9f25" class="outline-3">
<h3 id="org27f9f25">Entwurfsvorschrift IV - Phase 2</h3>
<div class="outline-text-3" id="text-org27f9f25">
<p>
<b>Datenanalyse/Datendefinition</b>
</p>

<ul class="org-ul">
<li>Ziel: Entwicklung einer adäquaten Datenstruktur</li>

<li><p>
Aktivität: Beschreibe die Datenstruktur in der Form:
</p>

<p>
; Ein \(s\) ist entweder<br />
; - ein \(t_1\) oder<br />
; - \(\ldots\) oder<br />
; - ein \(t_n\)
</p></li>

<li><p>
Für den Vertrag:
</p>
<div class="org-src-container">
<pre class="src src-clojure">   <span style="color: #707183;">{</span><span style="color: #D0372D;">:pre</span> <span style="color: #7388D6;">[</span><span style="color: #909183;">(</span><span style="color: #0000FF;">or</span> <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> t-1 s<span style="color: #709870;">)</span>
              ...
              <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> t-n s<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">]</span><span style="color: #707183;">}</span></pre>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgffbf078" class="outline-3">
<h3 id="orgffbf078">Entwurfsvorschrift IV - Phase 4</h3>
<div class="outline-text-3" id="text-orgffbf078">
<p>
<b>Funktionsschablone</b>
</p>

<ul class="org-ul">
<li>Ziel: Konstruktion der Fallunterscheidung nach der Art der Daten</li>

<li>Aktivitäten:

<ul class="org-ul">
<li>Lege die folgende Funktionsschablone an:</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-clojure">    <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">f</span>
      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>x<span style="color: #909183;">]</span>
        <span style="color: #909183;">{</span><span style="color: #D0372D;">:pre</span> <span style="color: #709870;">[</span><span style="color: #907373;">(</span><span style="color: #0000FF;">or</span> <span style="color: #6276BA;">(</span><span style="color: #006FE0;">instance?</span> t-1 x<span style="color: #6276BA;">)</span>
                   <span style="color: #6276BA;">(</span><span style="color: #006FE0;">instance?</span> t-2 x<span style="color: #6276BA;">)</span>
                    ...
                   <span style="color: #6276BA;">(</span><span style="color: #006FE0;">instance?</span> t-n x<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">]</span>
         <span style="color: #D0372D;">:post</span> <span style="color: #709870;">[</span>...<span style="color: #709870;">]</span><span style="color: #909183;">}</span>
        <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
           <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> t-1 x<span style="color: #709870;">)</span> ...
           <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> t-2 x<span style="color: #709870;">)</span> ...
           ...
           <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> t-n x<span style="color: #709870;">)</span> ...<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span></pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3f438b" class="outline-2">
<h2 id="orgc3f438b">Exkurs: Algebraische Datentypen</h2>
<div class="outline-text-2" id="text-orgc3f438b">
</div><div id="outline-container-orge8bd49e" class="outline-3">
<h3 id="orge8bd49e">Produkttypen</h3>
<div class="outline-text-3" id="text-orge8bd49e">
<ul class="org-ul">
<li>Die in Kapitel <a href="#org77a5a1f">Datenstrukturen</a> erläuterten Strukturdefinitionen
nennt man of auch <i>Produkte</i>.</li>
<li>Die Menge aller Exemplare der Record-Definition <code>punkt</code>
(vgl. <a href="#org71a9520">Record-Definition in Clojure</a>) kann man als als Teilmenge des
kartesischen Produkts 
\[number \times number\]
angesehen werden.</li>
<li>Daher die Bezeichnung <i>Produkttypen</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d5d0b1" class="outline-3">
<h3 id="org8d5d0b1">Summentypen</h3>
<div class="outline-text-3" id="text-org8d5d0b1">
<ul class="org-ul">
<li><p>
Die in Kapitel <a href="#orgd25b875">Gemischte Daten</a> eingeführten varianten Typen
</p>
<blockquote>
<p>
Eine Figur ist entweder ein Rechteck oder ein Kreis.
</p>
</blockquote>
<p>
werden auch als Summentypen bezeichnet.
</p></li>
<li>Die Menge aller Figuren ist die Vereinigung der Menge aller Kreise
mit der Menge aller Rechtecke.</li>
<li>Die <i>Vereinigung von Mengen</i> wird auch als die <i>Summe der Mengen</i>
bezeichnet.</li>
<li>Daher die Bezeichnung Summentypen.</li>
</ul>
</div>

<div id="outline-container-org3a3f543" class="outline-4">
<h4 id="org3a3f543">Haskell</h4>
<div class="outline-text-4" id="text-org3a3f543">
<p>
Der Begriff der algebraischen Datentypen ist inbesondere im Kontext
der Programmiersprache <a href="https://www.haskell.org">Haskell</a> sehr gebräuchlich.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org49d8d24" class="outline-2">
<h2 id="org49d8d24">Exkurs: Funktionale vs. objektorientierte Programmierung</h2>
