Vorlesung/ProPar-FuProAlgDat.org
** Objektorientierte Programmierung ...
... ist gekennzeichnet durch dynamische Bindung und Polymorphie

Polymorphie-Ansatz der meisten OO-Sprachen:

-  Methoden werden innerhalb von Klassen definiert.
-  Methodenaktivierung durch „Senden von Nachrichten”: Die zu
   aktivierende Methode wird anhand der Klassenzugehörigkeit des
   Empfängerobjekts bestimmt.
#+begin_small
#+BEGIN_SRC java
          class Rechteck {
             int breite, hoehe;
             int flaeche() { ... }}
   
          class Kreis {
             int radius;
             int flaeche() { ... }}
#+END_SRC
#+end_small
-  Jeder „Datentyp” definiert seine Operationen.
-  *Problem*: Datentypen können ohne Zugriff auf den Quellcode nicht
   erweitert werden.

** Funktionale Programmierung ...
... ist gekennzeichnet durch Funktionen als Werte erster Ordnung und die Abwesenheit von
Seiteneffekten

-  Funktionen enthalten Fallunterscheidungen für Datentypen.

   #+begin_small
   #+BEGIN_SRC clojure
   (def figur-flaeche
     (fn [f]
       (cond
         (instance? kreis f)
         (kreis-flaeche f)
         (instance? rechteck f)
         (rechteck-flaeche f))))
   #+END_SRC
   #+end_small

-  *Problem*: Hinzufügen eines neuen Datentyps bedeutet: Alle vorhanden
   Figur-Funktionen müssen angepasst werden.

** Das Expression-Problem
+ Die Weiterentwicklung von Programmen betrifft
  + das Hinzufügen von Operationen für bestehende Datentypen (Klassen)
    und
  + das Hinzufügen von Datentypen für bestehende Operationen.
+ Dabei soll möglichst vermieden werden, bestehenden Code zu ändern
  oder neu zu kompilieren.
+ Der Ausdruck /expression problem/ stammt von [[https://en.wikipedia.org/wiki/Philip_Wadler][Philip Wadler]] ([[//www.daimi.au.dk/~madst/tool/papers/expression.txt][The
  ExpressionProblem Philip Wadler, 12 November 1998)]]
+ Lösungen
  + Haskells Typklassen
  + Rubys /open classes/
  + Smalltalks /class extensions/
  + Clojures /protocols/
