Vorlesung/ProPar-FuProAlgDat.html
<div class="outline-text-2" id="text-org49d8d24">
</div><div id="outline-container-org432b431" class="outline-3">
<h3 id="org432b431">Objektorientierte Programmierung &#x2026;</h3>
<div class="outline-text-3" id="text-org432b431">
<p>
&#x2026; ist gekennzeichnet durch dynamische Bindung und Polymorphie
</p>

<p>
Polymorphie-Ansatz der meisten OO-Sprachen:
</p>

<ul class="org-ul">
<li>Methoden werden innerhalb von Klassen definiert.</li>
<li>Methodenaktivierung durch „Senden von Nachrichten”: Die zu
aktivierende Methode wird anhand der Klassenzugehörigkeit des
Empfängerobjekts bestimmt.</li>
</ul>
<div class="small">
<div class="org-src-container">
<pre class="src src-java">          <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Rechteck</span> <span style="color: #707183;">{</span>
             <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">breite</span>, <span style="color: #BA36A5;">hoehe</span>;
             <span style="color: #6434A3;">int</span> <span style="color: #006699;">flaeche</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> ... <span style="color: #7388D6;">}</span><span style="color: #707183;">}</span>
   
          <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Kreis</span> <span style="color: #707183;">{</span>
             <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">radius</span>;
             <span style="color: #6434A3;">int</span> <span style="color: #006699;">flaeche</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> ... <span style="color: #7388D6;">}</span><span style="color: #707183;">}</span></pre>
</pre>
</div>

</div>
<ul class="org-ul">
<li>Jeder „Datentyp” definiert seine Operationen.</li>
<li><b>Problem</b>: Datentypen können ohne Zugriff auf den Quellcode nicht
erweitert werden.</li>
</ul>
</div>
</div>

<div id="outline-container-orge51a93c" class="outline-3">
<h3 id="orge51a93c">Funktionale Programmierung &#x2026;</h3>
<div class="outline-text-3" id="text-orge51a93c">
<p>
&#x2026; ist gekennzeichnet durch Funktionen als Werte erster Ordnung und die Abwesenheit von
Seiteneffekten
</p>

<ul class="org-ul">
<li><p>
Funktionen enthalten Fallunterscheidungen für Datentypen.
</p>

<div class="small">
<div class="org-src-container">
<pre class="src src-clojure">   <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">figur-flaeche</span>
     <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>f<span style="color: #909183;">]</span>
       <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
         <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> kreis f<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>kreis-flaeche f<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #006FE0;">instance?</span> rechteck f<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>rechteck-flaeche f<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span></pre>
</pre>
</div>

</div></li>

<li><b>Problem</b>: Hinzufügen eines neuen Datentyps bedeutet: Alle vorhanden
Figur-Funktionen müssen angepasst werden.</li>
</ul>
</div>
</div>

<div id="outline-container-org82cc8c1" class="outline-3">
<h3 id="org82cc8c1">Das Expression-Problem</h3>
<div class="outline-text-3" id="text-org82cc8c1">
<ul class="org-ul">
<li>Die Weiterentwicklung von Programmen betrifft
<ul class="org-ul">
<li>das Hinzufügen von Operationen für bestehende Datentypen (Klassen)
und</li>
<li>das Hinzufügen von Datentypen für bestehende Operationen.</li>
</ul></li>
<li>Dabei soll möglichst vermieden werden, bestehenden Code zu ändern
oder neu zu kompilieren.</li>
<li>Der Ausdruck <i>expression problem</i> stammt von <a href="https://en.wikipedia.org/wiki/Philip_Wadler">Philip Wadler</a> (<a href="file://www.daimi.au.dk/~madst/tool/papers/expression.txt">The
ExpressionProblem Philip Wadler, 12 November 1998)</a></li>
<li>Lösungen
<ul class="org-ul">
<li>Haskells Typklassen</li>
<li>Rubys <i>open classes</i></li>
<li>Smalltalks <i>class extensions</i></li>
<li>Clojures <i>protocols</i></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2017-10-10 Tue 21:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>